app/controllers/members_controller.rb

INSERT INTO `members` (`created_at`, `email`, `food`, `group`, `mobile_phone`, `name`, `office_phone`, `person_type`, `personal_id`, `room_date`, `room_partiner`, `room_type`, `school`, `title`, `transportation`, `updated_at`) VALUES ('2015-09-02 09:49:55', '戶籍：632 雲林縣虎尾鎮安溪里2鄰安溪56之7號', 1, 6, '行動電話：0912-997753', '單位：雲林縣私立永年高級中學董事會', '服務聖堂：樹仔腳聖若瑟天主堂   辦公室電話：05-5842747', 1, '職稱：董事     姓名：張欽真神父', 0, '', 1, '出生年月日：46年3月7日', '身份證字號：Q120964054', 2, '2015-09-02 09:49:55')
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

SELECT `members`.* FROM `members`
---
  def success
    @members = Member.all

UPDATE `members` SET `email` = 'taichis@shsh.ylc.edu.tw', `mobile_phone` = '0912-997753', `name` = '張欽真', `office_phone` = '05-5842747', `personal_id` = 'Q120964054', `school` = '私立永年高級中學', `title` = '董事', `updated_at` = '2015-09-02 09:57:31' WHERE `members`.`id` = 29
---
  def update
    respond_to do |format|
      if @member.update(member_params)

DELETE FROM `members` WHERE `members`.`id` = 17
---
  def destroy
    @member.destroy

SELECT  `members`.* FROM `members`  WHERE `members`.`id` = 29 LIMIT 1
---
    def set_member
      @member = Member.find(params[:id])