app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`account`, `created_at`, `is_admin`, `name`, `password`, `updated_at`) VALUES ('MyString', '2015-09-02 06:49:12', 0, 'MyString', 'MyString', '2015-09-02 06:49:12')

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1